Repository: Henvag/Machine_learning_WebApp
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: no

source: ML Switch App
no: ML Bytte App

source: This Flask-based web application can train and evaluate different supervised ML models on various public datasets. Select a dataset and model type below to see the training and test metrics.
no: Dette er en Flask-basert webapplikasjon som kan trene og evaluere ulike supervised ML-modeller på forskjellige offentlige datasett. Velg et datasett og modelltype nedenfor for å se trenings- og testmetrikker.

source: Select Dataset:
no: Velg Datasett:

source: Diabetes (Regression)
no: Diabetes (Regresjon)

source: Iris (Classification)
no: Iris (Klassifisering)

source: Select Model Type:
no: Velg Modelltype:

source: Regression
no: Regresjon

source: Classification
no: Klassifisering

source: Run
no: Kjør

source: Training Score
no: Treningsscore

source: R2 Score
no: R²-score
